'''
视图类
'''


class view (object):

    def printAdminView(self):
        '''
        该方法用于打印管理员启动界面
        :return:
        '''
        print("***************************************")
        print("*                                     *")
        print("*          欢迎使用傻强银行            *")
        print("*                                     *")
        print("*                                     *")
        print("***************************************")

    def printSysFunctionView(self):
        '''
        该方法用于打印系统功能界面
        :return:
        '''

        print("***************************************")
        print("*   开户(1)                 查询(2)   *")
        print("*   取款(3)                 存款(4)   *")
        print("*   转账(5)                 改密(6)   *")
        print("*   锁定(7)                 解锁(8)   *")
        print("*   补卡(9)                 销户(0)   *")
        print("*                退出（t）            *")
        print("***************************************")